

'''
سلام استاد روز بخیر ان کد هاست بخش اول برای سوال اول و در ادامه به سوال دوم و سوم پرداختم 
در بخشی که باید سوال سوم رو انجام میدادم سعی کرد متن های درست انگلیسی رو برای پرینت بگذارم ولی خب انگلیسیم ضعیفه و شرمنده ام اگر جایی رو اشتباه نوشتم 
 ممنون که دارید چک میکنید و وقت میگذارید اگر هم جایی اشکال داشت ممنون میشم بگید درستش کنم 
استاد بخش آخر هنوز کامل نشده براتون آماده شد بخش آخر اضافه میکنم


سلام عرض شد خیلی عالی موردی نداره باز من هر بخشی نیاز بود رو براتون تغییر میدم همچنین سعی کن یک فایل به نام دیوایس فقط دیوایس و 
camera
توش باشه و یک فایل به نام کنترل پنل بساز که دیوایس و کنترل پنل داخلش باشه چون دوتا قسمت حساب میشه پروژه 
اگه سختت بود بگو من خودم اینجا برات تغییرات رو بدم دوتا فایلش کنم برای راحتی
موفق باشی



استاد جسارته میدونم ولی بنده بلد نیستم دوتا فایلش کنم اگر زحمت ننمیشه خودتون انجام من هنوز روی بخش آخر قسمت سوم پروژ] گیر کردم ممنون میشم خودتون این دوفایلی کردن رو انجام بدید و من به اون برسم بازم ببخشید که زحمت میدم


استاد سلام بخش آخر سوال سوم رو ارسال کردم و به آخر این پروژه اضافه کردم ولی یه مشکلی که داره اینه که درست اجرا نمیشه میشه لطفا چک کنید هرچه کردم درست نشد یعنی به نظر کد درسته البته فکر کنم ولی درست اجرا نمیشه



APM:

سلام فعلا در همین جا با هم جلو میریم و بعدا دوتا فایلش میکنم برات
ببین مشکل اصلی ای که کدت داشت اینه که آیدنت رو رعایت نمیکنی
یعنی فاصله هایی که پایتون براش مهمه ، تمام توابع ها باید زیر هم باشه
یعنی همشون ۴ تا اسپیس فاصله داره از چپ 
یا شروع هر تابع داخلش باید از اسم تابع ۴ تا اسپیس داشته باشه
من هم هاینارو اینجا اوکی کردم

مشکل از شما نیست ، در اسپایدر و خیلی ادیتور ها به صورت اتومات این فاصله هارو
براتون درست میکنه اما ادیتور گیت هاب این قابلیت رو نداره



---------------------
ممنون که وقت گذاشتید و مشکلات رو درست کردید اگر باز هم مشکلی در کد بود امر کنید بنده درستش میکنم و همینجا میگذارم 

پس الان کد  مشکلی نداری دیگه ؟




APM:

سلام مجدد من فردا کد هارو به دو تا کد به نام 
device 
و
control_panel 
تبدیل میکنم و نظرم رو روی هر قسمت براتون میزارم 
موفق باشید
------------
ممنون
استاد دیگه کد ها هیچ مسکلی نداره
'''




